/* 预查
- 正向肯定预查 (?=pattern) ：表示的是从其当前位置开始，预测后面的字符串必须匹配上pattern
- 正向否定预查 (?!pattern) ：表示的是从其当前位置开始，预测后面的字符串必须匹配不上pattern
- 反向肯定预查 (?<=pattern) ：表示的是从其当前位置开始，预测前面的字符串必须匹配上pattern
- 反向否定预查 (?<!pattern) ：表示的是从其当前位置开始，预测前面的字符串必须匹配不上pattern
*/

/* ----------------------------------------- 字符串格式化 ----------------------------------------- */
;(function () {
  const str = '100000000000000'
  console.log(
    str.replace(/\B(?=(\d{3})+$)/g, (...args) => {
      console.log(args)
      return ','
    })
  )
})()
