/* ----------------------------------------- 指数运算符 ----------------------------------------- */
/* 
- 符号: **
- 右结合 从右边开始计算
*/
;(function () {
  console.log(2 ** 3) //
  console.log(3 ** (2 ** 2)) // 81
})

/* ----------------------------------------- 链判断运算符 ----------------------------------------- */
/* 
- 符号: ?.
- ES2020 引入
- 3种用法
  - obj?.prop
  - obj?.[prop]
  - func?.()
*/
;(function () {})

/* ----------------------------------------- null判读运算符 ----------------------------------------- */
/* 
- 符号: ??
- 作用: 只有当左侧的值是 undefined 或 null 的时候 才会返回右侧的值
*/
;(function () {
  console.log(0 ?? 1) // 0
  console.log(false ?? 1) // false
  console.log(undefined ?? 1) // 1
  console.log(null ?? 1) // 1
})

/* ----------------------------------------- 逻辑赋值运算符 ----------------------------------------- */
/* 
- 或赋值运算符: ||= 例如: x ||= y 等同于 x = x || y
- 与赋值运算符: &&= 例如: x &&= y 等同于 x = x && y
- Null 赋值运算符: ??= 例如: x ??= y 等同于 x = x ?? y
*/
;(function () {})
